app/views/clients/index.html.slim

            td = link_to client.name, client_path(client)
            td = client.reports.size
            td = client.users.size
---
SELECT COUNT(*) FROM "reports" WHERE "reports"."client_id" = ?  [["client_id", 3]]
SELECT COUNT(*) FROM "users" WHERE "users"."client_id" = ?  [["client_id", 3]]