app/controllers/clients_controller.rb

INSERT INTO "clients" ("name", "logo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "new"], ["logo", "new"], ["created_at", "2015-10-23 15:42:15.933708"], ["updated_at", "2015-10-23 15:42:15.933708"]]
---
  def create
    @client = Client.new(client_params)

    if @client.save

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "clients" SET "name" = ?, "logo" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["name", "UPS"], ["logo", "ups logo"], ["updated_at", "2015-10-23 16:13:06.760266"], ["id", 1]]
---
  def update
    @client = Client.find(params[:id])

    if @client.update(client_params)

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 2]]
---
  def destroy
    @client = Client.find(params[:id])
    @client.destroy