app/controllers/reports_controller.rb

  def index
    @reports = Report.all
---
SELECT "reports".* FROM "reports"

  def new
    @client = Client.find(params[:client_id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", nil]]

  def create
    @client = Client.find(params[:client_id])
    @report = @client.reports.create(report_params)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "reports" ("commenter", "body", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "New Report"], ["body", "lots of words"], ["client_id", 1], ["created_at", "2015-10-23 16:32:12.954611"], ["updated_at", "2015-10-23 16:32:12.954611"]]

  def destroy
    @client = Client.find(params[:client_id])
    @report = @client.reports.find(params[:id])
    @report.destroy
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "reports".* FROM "reports" WHERE "reports"."client_id" = ? AND "reports"."id" = ? LIMIT 1  [["client_id", 3], ["id", 2]]
DELETE FROM "reports" WHERE "reports"."id" = ?  [["id", 2]]