app/controllers/users_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 4]]
---
  def new
    @client = Client.find(params[:client_id])

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "users" ("name", "email", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Abby"], ["email", "test@test.com"], ["client_id", 3], ["created_at", "2015-10-23 16:58:08.678546"], ["updated_at", "2015-10-23 16:58:08.678546"]]
---
  def create
    @client = Client.find(params[:client_id])
    @user = @client.users.create(user_params)

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."client_id" = ? AND "users"."id" = ? LIMIT 1  [["client_id", 3], ["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    @client = Client.find(params[:client_id])
    @user = @client.users.find(params[:id])
    @user.destroy